Page({
  data: {
    poets: [
      {
        name: '李白',
        description: '李白（701年－762年） ，字太白，号青莲居士，又号“谪仙人”，祖籍陇西成纪（今甘肃省秦安县），出生于蜀郡绵州昌隆县（一说出生于西域碎叶）。唐代伟大的浪漫主义诗人，被后人誉为“诗仙”，与杜甫并称为“李杜”，为了与另两位诗人李商隐与杜牧即“小李杜”区别，杜甫与李白又合称“大李杜”。据《新唐书》记载，李白为兴圣皇帝（凉武昭王李暠）九世孙，与李唐诸王同宗。其人爽朗大方，爱饮酒作诗，喜交友。李白深受黄老列庄思想影响，有《李太白集》传世，诗作中多为醉时写就，代表作有《望庐山瀑布》《行路难》《蜀道难》《将进酒》《早发白帝城》等。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/libai.jpg?sign=e9f15329a36680563323710d396a7591&t=1719125403")',
        other:'经典之作：',
        poems: [
          {
            title: '《静夜思》',
            content: '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
          },
          {
            title: '《独坐敬亭山》',
            content: '众鸟高飞尽，孤云独去闲。相看两不厌，只有敬亭山。'
          },
          {
            title: '《赠汪伦》',
            content: '李白乘舟将欲行，忽闻岸上踏歌声。桃花潭水深千尺，不及汪伦送我情。'
          }
        ]
      },
      {
        name: '杜甫',
        description: '杜甫（712－770），字子美，自号少陵野老，世称“杜工部”、“杜少陵”等，汉族，河南府巩县（今河南省巩义市）人，唐代伟大的现实主义诗人，杜甫被世人尊为“诗圣”，其诗被称为“诗史”。杜甫与李白合称“李杜”，为了跟另外两位诗人李商隐与杜牧即“小李杜”区别开来，杜甫与李白又合称“大李杜”。他忧国忧民，人格高尚，他的约1400余首诗被保留了下来，诗艺精湛，在中国古典诗歌中备受推崇，影响深远。759-766年间曾居成都，后世有杜甫草堂纪念。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/dufu.jpeg?sign=e8cdf64c022afa79b4d921405301913d&t=1719125420")',
        other:'经典之作：',
        poems: [
          {
            title: '《春望》',
            content: '国破山河在，城春草木深。感时花溅泪，恨别鸟惊心。烽火连三月，家书抵万金。白头搔更短，浑欲不胜簪。'
          },
          {
            title: '《望岳》',
            content: '岱宗夫如何？齐鲁青未了。造化钟神秀，阴阳割昏晓。荡胸生曾云，决眦入归鸟。会当凌绝顶，一览众山小。'
          },
          {
            title: '《绝句》',
            content: '两个黄鹂鸣翠柳，一行白鹭上青天。窗含西岭千秋雪，门泊东吴万里船。'
          }
        ]
      },
      {
        name: '白居易',
        description: '白居易（772年－846年），字乐天，号香山居士，又号醉吟先生，祖籍太原，到其曾祖父时迁居下邽，生于河南新郑。是唐代伟大的现实主义诗人，唐代三大诗人之一。白居易与元稹共同倡导新乐府运动，世称“元白”，与刘禹锡并称“刘白”。白居易的诗歌题材广泛，形式多样，语言平易通俗，有“诗魔”和“诗王”之称。官至翰林学士、左赞善大夫。公元846年，白居易在洛阳逝世，葬于香山。有《白氏长庆集》传世，代表诗作有《长恨歌》《卖炭翁》《琵琶行》等。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/baijuyi.jpeg?sign=e2f12c945c483122cbfe5f52bcd5e70f&t=1719125436")',
        other: '经典之作：',
        poems: [
          {
            title: '《钱塘湖春行》',
            content: '孤山寺北贾亭西，水面初平云脚低。几处早莺争暖树，谁家新燕啄春泥。乱花渐欲迷人眼，浅草才能没马蹄。最爱湖东行不足，绿杨阴里白沙堤。'
          },
          {
            title: '《赋得古原草送别》',
            content: '离离原上草，一岁一枯荣。野火烧不尽，春风吹又生。远芳侵古道，晴翠接荒城。又送王孙去，萋萋满别情。'
          },
          {
            title: '《忆江南》',
            content: '江南好，风景旧曾谙。日出江花红胜火，春来江水绿如蓝。能不忆江南？'
          }
        ]
      },
      {
        name: '王维',
        description: '王维（701年－761年，一说699年—761年），字摩诘(jié)，号摩诘居士。汉族，河东蒲州（今山西运城）人，祖籍山西祁县，唐朝诗人，有“诗佛”之称。苏轼评价其：“味摩诘之诗，诗中有画；观摩诘之画，画中有诗。”开元九年（721年）中进士，任太乐丞。天宝年间，拜吏部郎中、给事中。唐肃宗乾元年间任尚书右丞，世称“王右丞”。王维是盛唐诗人的代表，今存诗400余首，重要诗作有《相思》《山居秋暝》等。王维精通佛学，受禅宗影响很大。佛教有一部《维摩诘经》，是王维名和字的由来。王维诗书画都很有名，多才多艺，音乐也很精通。与孟浩然合称“王孟”。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/wangwei.jpg?sign=f94eb1b4e2ba903fef56d550201d779f&t=1719125450")',
        other: '经典之作：',
        poems: [
          {
            title: '《使至塞上》',
            content: '单车欲问边，属国过居延。征蓬出汉塞，归雁入胡天。大漠孤烟直，长河落日圆。萧关逢候骑，都护在燕然。。'
          },
          {
            title: '《九月九日忆山东兄弟》',
            content: '独在异乡为异客，每逢佳节倍思亲。遥知兄弟登高处，遍插茱萸少一人。'
          },
          {
            title: '《送元二使安西》',
            content: '渭城朝雨浥轻尘，客舍青青柳色新。劝君更尽一杯酒，西出阳关无故人。'
          }
        ]
      },
      {
        name: '陆游',
        description: '陆游（1125年11月13日－1210年1月26日），字务观，号放翁，汉族，越州山阴（今浙江绍兴）人，尚书右丞陆佃之孙，南宋文学家、史学家、爱国诗人。陆游生逢北宋灭亡之际，少年时即深受家庭爱国思想的熏陶。宋高宗时，参加礼部考试，因受秦桧排斥而仕途不畅。孝宗时赐进士出身。中年入蜀，投身军旅生活。嘉泰二年（1202年），宋宁宗诏陆游入京，主持编修孝宗、光宗《两朝实录》和《三朝史》，官至宝章阁待制。晚年退居家乡。创作诗歌今存九千多首，内容极为丰富。著有《剑南诗稿》《渭南文集》《南唐书》《老学庵笔记》等。 陆游一生笔耕不辍，诗词文俱有很高成就，其诗语言平易晓畅、章法整饬谨严，兼具李白的雄奇奔放与杜甫的沉郁悲凉，尤以饱含爱国热情对后世影响深远。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/luyou.jpeg?sign=c4412e1ef80f0757e1d9b236f5539b9f&t=1719125473")',
        other: '经典之作：',
        poems: [
          {
            title: '《游山西村》',
            content: '莫笑农家腊酒浑，丰年留客足鸡豚。山重水复疑无路，柳暗花明又一村。箫鼓追随春社近，衣冠简朴古风存。从今若许闲乘月，拄杖无时夜叩门。'
          },
          {
            title: '《卜算子·咏梅》',
            content: '驿外断桥边，寂寞开无主。已是黄昏独自愁，更着风和雨。(着 同：著)无意苦争春，一任群芳妒。零落成泥碾作尘，只有香如故。'
          },
          {
            title: '《示儿》',
            content: '死去元知万事空，但悲不见九州同。王师北定中原日，家祭无忘告乃翁。'
          }
        ]
      },
      {
        name: '苏轼',
        description: '苏轼，（1037年1月8日-1101年8月24日）字子瞻、和仲，号铁冠道人、东坡居士，世称苏东坡、苏仙，汉族，眉州眉山（四川省眉山市）人，祖籍河北栾城，北宋著名文学家、书法家、画家，历史治水名人。苏轼是北宋中期文坛领袖，在诗、词、散文、书、画等方面取得很高成就。文纵横恣肆；诗题材广阔，清新豪健，善用夸张比喻，独具风格，与黄庭坚并称“苏黄”；词开豪放一派，与辛弃疾同是豪放派代表，并称“苏辛”；散文著述宏富，豪放自如，与欧阳修并称“欧苏”，为“唐宋八大家”之一。苏轼善书，“宋四家”之一；擅长文人画，尤擅墨竹、怪石、枯木等。与韩愈、柳宗元和欧阳修合称“千古文章四大家”。作品有《东坡七集》《东坡易传》《东坡乐府》《潇湘竹石图卷》《古木怪石图卷》等。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/sushi.jpeg?sign=baa87ea4b12b968884b2f9a45174123f&t=1719125486")',
        other: '经典之作：',
        poems: [
          {
            title: '《水调歌头·明月几时有》',
            content: '丙辰中秋，欢饮达旦，大醉，作此篇，兼怀子由。明月几时有？把酒问青天。不知天上宫阙，今夕是何年。我欲乘风归去，又恐琼楼玉宇，高处不胜寒。起舞弄清影，何似在人间。(何似 一作：何时；又恐 一作：惟 / 唯恐)转朱阁，低绮户，照无眠。不应有恨，何事长向别时圆？人有悲欢离合，月有阴晴圆缺，此事古难全。但愿人长久，千里共婵娟。(长向 一作：偏向)'
          },
          {
            title: '《江城子·乙卯正月二十日夜记梦》',
            content: '十年生死两茫茫，不思量，自难忘。千里孤坟，无处话凄凉。纵使相逢应不识，尘满面，鬓如霜。夜来幽梦忽还乡，小轩窗，正梳妆。相顾无言，惟有泪千行。料得年年肠断处，明月夜，短松冈。'
          },
          {
            title: '《江城子·密州出猎》',
            content: '老夫聊发少年狂，左牵黄，右擎苍，锦帽貂裘，千骑卷平冈。为报倾城随太守，亲射虎，看孙郎。酒酣胸胆尚开张。鬓微霜，又何妨！持节云中，何日遣冯唐？会挽雕弓如满月，西北望，射天狼。'
          }
        ]
      },
      {
        name: '辛弃疾',
        description: '辛弃疾（1140年5月28日－1207年10月3日），原字坦夫，后改字幼安，中年后别号稼轩，山东东路济南府历城县（今山东省济南市历城区）人。南宋官员、将领、文学家，豪放派词人，有“词中之龙”之称。与苏轼合称“苏辛”，与李清照并称“济南二安”。辛弃疾出生时，中原已为金兵所占。21岁参加抗金义军，不久归南宋。历任湖北、江西、湖南、福建、浙东安抚使等职。一生力主抗金。曾上《美芹十论》与《九议》，条陈战守之策。其词抒写力图恢复国家统一的爱国热情，倾诉壮志难酬的悲愤，对当时执政者的屈辱求和颇多谴责；也有不少吟咏祖国河山的作品。题材广阔又善化用前人典故入词，风格沉雄豪迈又不乏细腻柔媚之处。由于辛弃疾的抗金主张与当政的主和派政见不合，后被弹劾落职，退隐江西带湖。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/xinqiji.jpeg?sign=fc8056ea5b679febc802b8d2e4d9e520&t=1719125500")',
        other: '经典之作：',
        poems: [
          {
            title: '《永遇乐·京口北固亭怀古》',
            content: '千古江山，英雄无觅，孙仲谋处。舞榭歌台，风流总被，雨打风吹去。斜阳草树，寻常巷陌，人道寄奴曾住。想当年，金戈铁马，气吞万里如虎。元嘉草草，封狼居胥，赢得仓皇北顾。四十三年，望中犹记，烽火扬州路。可堪回首，佛狸祠下，一片神鸦社鼓。凭谁问：廉颇老矣，尚能饭否？'
          },
          {
            title: '《破阵子·为陈同甫赋壮词以寄之》',
            content: '醉里挑灯看剑，梦回吹角连营。八百里分麾下炙，五十弦翻塞外声，沙场秋点兵。马作的卢飞快，弓如霹雳弦惊。了却君王天下事，赢得生前身后名。可怜白发生！'
          },
          {
            title: '《青玉案·元夕》',
            content: '东风夜放花千树，更吹落、星如雨。宝马雕车香满路。凤箫声动，玉壶光转，一夜鱼龙舞。蛾儿雪柳黄金缕，笑语盈盈暗香去。众里寻他千百度。蓦然回首，那人却在，灯火阑珊处。'
          }
        ]
      },
      {
        name: '杜牧',
        description: '杜牧（公元803－约852年），字牧之，号樊川居士，汉族，京兆万年（今陕西西安）人，唐代诗人。杜牧人称“小杜”，以别于杜甫。与李商隐并称“小李杜”。因晚年居长安南樊川别墅，故后世称“杜樊川”，著有《樊川文集》。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/dumu.jpeg?sign=9b6fc86720a795f7a2a7e202cd9f078f&t=1719125513")',
        other: '经典之作：',
        poems: [
          {
            title: '《清明》',
            content: '清明时节雨纷纷，路上行人欲断魂。借问酒家何处有？牧童遥指杏花村。'
          },
          {
            title: '《泊秦淮》',
            content: '烟笼寒水月笼沙，夜泊秦淮近酒家。商女不知亡国恨，隔江犹唱后庭花。'
          },
          {
            title: '《赤壁》',
            content: '折戟沉沙铁未销，自将磨洗认前朝。东风不与周郎便，铜雀春深锁二乔。'
          },
          {
            title: '《山行》',
            content: '远上寒山石径斜，白云生处有人家。(生处 一作：深处)停车坐爱枫林晚，霜叶红于二月花。'
          }

        ]
      },
      {
        name: '李清照',
        description: '李清照（1084年3月13日～1155年5月12日）号易安居士，汉族，山东省济南章丘人。宋代（南北宋之交）词人，婉约词派代表，有“千古第一才女”之称。所作词，前期多写其悠闲生活，后期多悲叹身世，情调感伤。形式上善用白描手法，自辟途径，语言清丽。论词强调协律，崇尚典雅，提出词“别是一家”之说，反对以作诗文之法作词。能诗，留存不多，部分篇章感时咏史，情辞慷慨，与其词风不同。有《易安居士文集》《易安词》，已散佚。后人有《漱玉词》辑本。今有《李清照集校注》。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/liqingzhao.jpeg?sign=5956a90a0bc9d56fda76ad6caba1faf6&t=1719125525")',
        other: '经典之作：',
        poems: [
          {
            title: '《声声慢·寻寻觅觅》',
            content: '寻寻觅觅，冷冷清清，凄凄惨惨戚戚。乍暖还寒时候，最难将息。三杯两盏淡酒，怎敌他、晚来风急！雁过也，正伤心，却是旧时相识。满地黄花堆积，憔悴损，如今有谁堪摘？守着窗儿，独自怎生得黑！梧桐更兼细雨，到黄昏、点点滴滴。这次第，怎一个愁字了得！(守着窗儿 一作：守著窗儿)'
          },
          {
            title: '《一剪梅·红藕香残玉簟秋》',
            content: '红藕香残玉簟秋。轻解罗裳，独上兰舟。云中谁寄锦书来？雁字回时，月满西楼。花自飘零水自流。一种相思，两处闲愁。此情无计可消除，才下眉头，却上心头。'
          },
          {
            title: '《武陵春·春晚》',
            content: '风住尘香花已尽，日晚倦梳头。物是人非事事休，欲语泪先流。闻说双溪春尚好，也拟泛轻舟。只恐双溪舴艋舟，载不动许多愁。'
          }

        ]
      },
      {
        name: '韩愈',
        description: '韩愈（768年－824年12月25日），字退之，河南河阳（今河南孟州）人，一说怀州修武（今河南修武）人 ，自称“郡望昌黎（今辽宁义县）” ，世称“韩昌黎”“昌黎先生”。中国唐朝中期官员、文学家、思想家、哲学家、政治家、教育家。秘书郎韩仲卿之子。元和十二年（817年），出任宰相裴度行军司马，从平“淮西之乱”。直言谏迎佛骨，贬为潮州刺史。宦海沉浮，累迁吏部侍郎，人称“韩吏部”。长庆四年（824年），韩愈病逝，年五十七，追赠礼部尚书，谥号为“文”，故称“韩文公”。元丰元年（1078年），追封昌黎郡伯，并从祀孔庙。韩愈作为唐代古文运动的倡导者，名列“唐宋八大家”之首，有“文章巨公”和“百代文宗”之名。与柳宗元并称“韩柳”，与柳宗元、欧阳修和苏轼并称“千古文章四大家”。倡导“文道合一”、“气盛言宜”、“务去陈言”、“文从字顺”等写作理论，对后人具有指导意义。著有《韩昌黎集》等。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/hanyu.jpeg?sign=6c0d7f1be2922d461588de37b0711767&t=1719125539")',
        other: '经典之作：',
        poems: [
          {
            title: '《早春呈水部张十八员外》',
            content: '天街小雨润如酥，草色遥看近却无。最是一年春好处，绝胜烟柳满皇都。'
          },
          {
            title: '《马说》',
            content: '世有伯乐，然后有千里马。千里马常有，而伯乐不常有。故虽有名马，祗辱于奴隶人之手，骈死于槽枥之间，不以千里称也。(祗 同：衹)马之千里者，一食或尽粟一石。食马者不知其能千里而食也。是马也，虽有千里之能，食不饱，力不足，才美不外见，且欲与常马等不可得，安求其能千里也？策之不以其道，食之不能尽其材，鸣之而不能通其意，执策而临之，曰：“天下无马！”呜呼！其真无马邪？其真不知马也！'
          },
          {
            title: '《春雪》',
            content: '新年都未有芳华，二月初惊见草芽。白雪却嫌春色晚，故穿庭树作飞花。'
          }

        ]
      },
      {
        name: '王安石',
        description: '王安石（1021年12月18日－1086年5月21日），字介甫，号半山，谥文，封荆国公。世人又称王荆公。汉族，北宋抚州临川人（今江西省抚州市临川区邓家巷人），中国北宋著名政治家、思想家、文学家、改革家，唐宋八大家之一。欧阳修称赞王安石：“翰林风月三千首，吏部文章二百年。老去自怜心尚在，后来谁与子争先。”传世文集有《王临川集》、《临川集拾遗》等。其诗文各体兼擅，词虽不多，但亦擅长，且有名作《桂枝香》等。而王荆公最得世人共传之诗句莫过于《泊船瓜洲》中的“春风又绿江南岸，明月何时照我还。”',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/wanganshi.jpeg?sign=d31d7f0a209fc5e5f995f1a09dab2de6&t=1719125551")',
        other: '经典之作：',
        poems: [
          {
            title: '《元日》',
            content: '爆竹声中一岁除，春风送暖入屠苏。千门万户曈曈日，总把新桃换旧符。'
          },
          {
            title: '《梅花》',
            content: '墙角数枝梅，凌寒独自开。遥知不是雪，为有暗香来。'
          },
          {
            title: '《泊船瓜洲》',
            content: '京口瓜洲一水间，钟山只隔数重山。春风又绿江南岸，明月何时照我还。(又绿 一作：自绿)'
          },
          {
            title: '《登飞来峰》',
            content: '飞来山上千寻塔，闻说鸡鸣见日升。(飞来山 一作：飞来峰)不畏浮云遮望眼，自缘身在最高层。'
          }

        ]
      },
      {
        name: '陶渊明',
        description: '陶渊明（约365—427年），名潜，字元亮，别号五柳先生，私谥靖节，世称靖节先生，一说寻阳郡柴桑县（今江西九江）人，另一说江西宜丰人，东晋末到刘宋初杰出的诗人、辞赋家、散文家。被誉为“隐逸诗人之宗”“田园诗派之鼻祖”。是江西首位文学巨匠。曾任江州祭酒、建威参军、镇军参军、彭泽县令等职，最末一次出仕为彭泽县令，八十多天便弃职而去，从此归隐田园。他是中国第一位田园诗人，被称为“古今隐逸诗人之宗”，有《陶渊明集》。',
        backgroundImage: 'url("https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/taoyuanming.jpeg?sign=9db35fcc65c9a2356f333db4c4c85bcb&t=1719125581")',
        other: '经典之作：',
        poems: [
          {
            title: '《桃花源记》',
            content: '晋太元中，武陵人捕鱼为业。缘溪行，忘路之远近。忽逢桃花林，夹岸数百步，中无杂树，芳草鲜美，落英缤纷。渔人甚异之，复前行，欲穷其林。林尽水源，便得一山，山有小口，仿佛若有光。便舍船，从口入。初极狭，才通人。复行数十步，豁然开朗。土地平旷，屋舍俨然，有良田、美池、桑竹之属。阡陌交通，鸡犬相闻。其中往来种作，男女衣着，悉如外人。黄发垂髫，并怡然自乐。见渔人，乃大惊，问所从来。具答之。便要还家，设酒杀鸡作食。村中闻有此人，咸来问讯。自云先世避秦时乱，率妻子邑人来此绝境，不复出焉，遂与外人间隔。问今是何世，乃不知有汉，无论魏晋。此人一一为具言所闻，皆叹惋。余人各复延至其家，皆出酒食。停数日，辞去。此中人语云：“不足为外人道也。”(间隔 一作：隔绝)既出，得其船，便扶向路，处处志之。及郡下，诣太守，说如此。太守即遣人随其往，寻向所志，遂迷，不复得路。南阳刘子骥，高尚士也，闻之，欣然规往。未果，寻病终。后遂无问津者。'
          },
          {
            title: '《饮酒·其五》',
            content: '结庐在人境，而无车马喧。问君何能尔？心远地自偏。采菊东篱下，悠然见南山。山气日夕佳，飞鸟相与还。此中有真意，欲辨已忘言。'
          },
          {
            title: '《归园田居·其三》',
            content: '种豆南山下，草盛豆苗稀。晨兴理荒秽，带月荷锄归。道狭草木长，夕露沾我衣。衣沾不足惜，但使愿无违。'
          }
        ]
      }
      // 添加其他诗人的数据
    ],
    currentPoetIndex: 0
  },
  // 页面加载时随机选择一个诗人
  onLoad: function() {
    let randomIndex = Math.floor(Math.random() * this.data.poets.length);
    this.setData({
      currentPoetIndex: randomIndex
    });
  },
  // 切换诗人函数
  switchPoet: function() {
    let randomIndex = Math.floor(Math.random() * this.data.poets.length);
    this.setData({
      currentPoetIndex: randomIndex
    });
  }
});
