Page({
  data: {
    pages: [
      {
        title: "前言",
        content1: "如果只是线性的讲发展史，诗到晚唐就可以了，因为后来直到民国前都是只有流派之争，没有诗本身的变化。而从上古到晚唐，中间的秦末汉初到东汉末年，其实也乏善可陈。所以真正要讲诗歌变化，无非是春秋时期、魏晋南北朝、唐朝。这就是中国古诗的三大发展阶段，唐朝到了顶峰，进入了格律诗领域，之后虽有宋诗、清诗两个高峰，但是都是在内容、流派上出彩，于形式上再无进步。",
        content2: "实际上就是诗的产生、诗的发展、诗的顶峰三个阶段。诗歌发展到格律诗是自身发展的必然，就当时的情况来说，格律诗是先进的体裁形式。而且格律诗的出现并没有阻挡古体诗前进的步伐，正是由于古体诗在前进的过程中出现了音律规范化，才总结出来格律诗。近体诗和古体诗是中国古诗的两大分类，齐头并进，共创辉煌，没有谁限制了谁，也没有谁取代了谁。有这种格律限制了古体诗的想法，从深层根源来说还是认为格律诗优于古体诗，只是你写不好，就被它限制了思想——懂格律的人根本不在乎自己写的是格律诗还是古体诗，在乎的是写得好不好的问题。",
        backgroundImage: 'https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/2.jpg?sign=9e8e6945f897c2af876465763b6ba438&t=1719124282',
      },
      {
        title: "诗的产生(先秦）",
        content1: "现在一般把《诗经》尊为中国古诗的源头。其实《诗经》的诗已经是一种相对成熟的形式，诗的起源要远远早于《诗经》。因为这是周朝中央政府派采诗官去四处收集民歌来编汇的，是经过了文化人的审定、修改的文学艺术作品——诗本来就是歌，我们要认清楚这一点。我们现在没事哼哼，其实就是诗的起点。把我们的哼哼变成文字，在节奏感和押韵上做出细化，就是诗。做出雅化，就脱离了打油诗。再做出字数规范，平仄调整，就称为近体诗。诗的产生，就是劳动之余的哼唱。有一种说法，诗来自劳动号子，这也有一定道理，不过要歌颂爱情、要歌颂友情、要歌颂基情（诗经中大把），绝对不是一边辛苦劳作，一边能背着喉咙喊出来的，所以劳动号子只可能是诗歌起源的部分组成。",
        content2:" 目前发现最早能被定义为诗歌的，应该是《吴越春秋》中的《弹歌》，这是二言诗，也是文言文节奏和押韵能做到的最小结构，初步具备了诗的性质：“断竹，续竹；飞土，逐宍。”越国的国君勾践向楚国的射箭能手陈音询问弓弹的道理，陈音在回答时引用了这首《弹歌》。“我砍了竹子，做成弓箭，发射石块，驱赶野兽。” 这是一个替父母守墓的小子无聊时候的发明，用来驱赶骚扰坟墓供品的野兽。还有箕子的《麦秀歌》等，一些上古的大概有些诗味的作品。而到了《诗经》，四言、整饬、押韵、重章叠唱、包罗万象，基本上已经囊括了后世所有流派诗歌的先行，所以我们可以称之为春秋时期诗歌的大成，而不仅仅是起源。",
        backgroundImage: 'https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/1.jpg?sign=797563d0b96d62db694a9fcbf9f797f7&t=1719124293',
      },
      {
        title: "诗的发展（两汉）",
        content1: "中原地区有《诗经》，南方则出现了长短句的《楚辞》。屈原是第一个具名出诗集的人，也就是从他开始，“诗人”的身份正式登上文化舞台——以前的作品署名大都是“佚名”。同时从《楚辞》开始，诗歌开始真正有了标题——以前的作品大都是取前面几个字或者一句作为标题。而且《楚辞》出现了杂言，这也是和《诗经》风格明显的差异，随着秦朝灭亡，楚地枭雄称王——项羽、刘邦都是楚人，这种风格的诗歌开始流行。汉朝文治武功，兵临天下，迎来了第一次多民族文化大融合——最为明显的就是音乐融合。轻快活泼的胡人音乐改变了中原音乐端庄稳重的节奏，至少在民间，这种宴乐飞快流行起来。随着音乐节奏变快，音乐章节变长，四言诗已经无法满足演唱——诗是歌词，牢记这一点——所以就出现了的五言诗、七言诗，甚至六言、八言、九言的作品。",
        content2:"不过由于汉朝经学一统天下，儒生老成持重，所以文艺方面的发展比较缓慢。大家更喜欢长篇大论的“汉大赋”，所以诗在两汉的发展缓慢。值得一写的就是汉武帝柏梁台上作联句游戏发明的句句押韵七言诗：“柏梁体”，这是一种小众的，后来被断句不押韵的格式淘汰了的诗体，但是也有佳作，如杜甫的《丽人行》。发明地动仪的张衡则写出了真正意义上的七言诗，《四愁诗》：“我所思兮在太山。欲往从之梁父艰，侧身东望涕沾翰。美人赠我金错刀，何以报之英琼瑶。路远莫致倚逍遥，何为怀忧心烦劳。……”但是直到汉末，甚至到了隋末唐初，七言诗虽然得到长足发展，但是在结构、音律规范等各方面还是五言诗走在前面。而且这一时期也没有绝句的产生，汉人以大为美，绝句体小而俗，不足以用。 ",
        backgroundImage: 'https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/3.jpg?sign=f87927f1b644230fcbb39de4556d158b&t=1719124314',
      },
      {
        title: "诗的飞跃（魏晋南北朝）",
        content1: "诗到了曹魏时期，产生质的飞跃。这一时期，文化还是掌握在贵族、文人手中，所以诗歌的发展也只可能在士大夫阶层发生。这一时期发生的最大变化就是有了文采这个概念。在东汉以前的诗歌，其实就类似于我们今天很多朋友淡如白水的现代诗，其主要的功用还是说事、抒情。但是如何说事、如何抒情，是没有概念的，即算是做出比喻和一定的修饰，也是讲究“浑然天成”，没有抱着修饰自己的文辞来突出自己情感的目的。 这一切，到曹植这里发生了改变。魏晋南北朝对诗词最大的贡献有两方面，而这两方面都是从曹植发端。",
        content2:" 一是文辞修饰之风发端。发展到后来，成为空洞无物，不说正事，只讲究形式主义的极端，即“齐梁体”，也就是后来所称的“宫体诗”，特色就是只要好听好看，“兴寄全无”，没有任何志向、抱负，沉迷于风花雪月、闺阁情思。文辞修饰对于文学作品是必须的，但是过度而忽视内容，就是形式主义，是走错了路了。所以陈子昂说：“文章道弊五百年矣”，就是批判这种形式大过内容的走向。二是音律学的发展。这个也是从曹植开始的，所以不能不说他是文学中的奇才啊。他发明了“梵呗”，开始寻求“徒歌”（没有音乐的诗歌）中文字发音的规律。随着南北朝佛教大流传，音韵学得到长足发展。沈约、周颙等人提出“四声八病”，并成功运用到诗歌的创作。音律的发展是唐朝平仄格律的基础，也是诗歌走向吟诵文本，脱离音乐独立存在的关键。经过这五百年的飞速发展，诗在形式上已经初具规模，在流派上（山水、边塞、讽喻等等）也是百花齐放，已经为盛唐飞歌做好了一切准备。",
        backgroundImage: 'https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/7.jpg?sign=fd3abd7056fd59e49563932d553916fc&t=1719124323',
      },
      {
        title: "诗的盛放（唐朝）",
        content1: "经过南北朝的文体格式准备，隋唐的文人开始了文风的大纠偏。陈子昂提出“汉魏风骨”的概念，至今为古诗爱好者所推崇。初唐四杰等无数初唐诗人在格式上沿袭宫体诗，在内容上不断开拓进取，在意向上生机勃勃，终于让唐诗成为既优美动听，又感情深厚的动人之作。但是这里有个误区，很多人认为唐诗的功臣是初唐四杰，以及盛唐大诗人（李、杜、王）等人。其实并非如此。 初唐四杰不是早夭就是困苦，要不就反叛，并没有政治地位，而陈子昂虽然提出了理论作为旗帜，但在失宠后影响也变小，无法真正带动诗风改革。对诗体规范起到作用是元兢（换头，相粘）、上官仪（对仗）、沈佺期、杜审言、宋之问等人。特别是这些宫廷诗人，精研格式，其实原本内容上是相对空洞的，但是他们遇上了风云动荡的武周王朝兴盛覆灭，唐玄宗李隆基上位这些政治变动。大批宫廷诗人被放逐，流落江湖。而人的境遇一旦波折，思想性自然就上升了，加上本身极好的格式研究，大批既有情感、又有形式的诗歌作品就问世了，从而带动了整个朝代的诗风。",
        content2:" 李白对于诗歌史的贡献主要是和王昌龄一起改进、规范了七绝。前面说到七言不被看重，到了他们这里才真正上位，并且一跃成为唐朝至今最为流行的诗歌格式。而在格律诗的完备上，杜甫是集大成者，同时，在是个理论上，也是他一锤定音，决定了唐诗重内容、重感情、崇汉魏的未来走向。至于大李杜在诗歌上的成就，这里就不多说了，但是大李杜冲到天花板的能力直接导致了中唐诗人的困境。中唐的诗人在李杜压力之下，无路可走，就开始了在盛唐诗路上分类深挖。如韩愈的“散文入诗”，李益专攻“边塞诗”，刘禹锡走怀古路线，并开发“竹枝词”，白居易走老百姓路线，李贺干脆就写鬼神之词去了。盛唐诗是高峰，中唐诗是高峰上的平原，四处分流，四处开花，所以论唐诗，盛唐、中唐的大诗人如流星赶月，层出不穷。这也是中国诗歌史上最好的时代。",
        backgroundImage: 'https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/5.jpg?sign=fe97961345277b6ff3e57795929e4e24&t=1719124332',
      },
      {
        title: "诗的后来（元明清）",
        content1: "进入晚唐，由于安史之乱后，政权虽然几经复兴，但总归是走下坡路了。整个王朝开始倾颓，文化意象就开始走南北朝末年的老路，诗风又往隐逸派和作乐派分流。志气不再高昂，内容自然低迷。当然，晚唐的李商隐在艺术成就上来说是最高的，因为他集合了前朝所有大诗人的特色。虽然有时候用典精深、晦涩难懂，但是他的诗歌成就在晚唐是最高的，甚至放在整个唐朝也不逊色。唯一和大李杜没办法比的是缺了气象，但这不是他的原因，是时代的原因。不过这些都是诗风变化，而对诗歌本身来说，到了晚唐，格律诗的规则已经坚如磐石，基本上连折腰体之类可有可无的出律，大家都很少犯了。而另外一种文体，曲子词已经开始在杜牧、白居易、刘禹锡手中登堂入室，成为诗规范之外，文人们更加灵动的思维奔流方向。",
        content2:" 那就是词牌史了。诗史也不是到这里就完结，只不过大概发展就是这样了，后来的复兴也没有突破格律、非格律，只不过是在内容上、表现上分门别类，再创高峰罢了。如宋朝的西昆体、太学体、香山体、江湖体、四灵诗派、江西诗派、包括后来清朝的公安派、性灵派，这些都只是时代内容进步和文人思想觉醒的不同层次，诗本身的形式没有变化。直到泰戈尔的《飞鸟集》现世——但是那个就属于现代诗史，基本上宣告了古诗史的完结——虽然我们今天还在写，不过是尽量承续，不让它们在我们这一代断绝罢了。诗的简史，大致如此。",
        backgroundImage: 'https://636c-cloud1-2gpac81i40983a59-1327119078.tcb.qcloud.la/images/6.jpg?sign=75bb539d83d3e11e2b3e0ba9c16dd440&t=1719124343',
      }
    ],
    currentPageIndex: 0,
  },

  switchPages: function() {
    let newIndex = this.data.currentPageIndex + 1;
    if (newIndex >= this.data.pages.length) {
      newIndex = 0; // 回到第一页
    }
    this.setData({
      currentPageIndex: newIndex
    });
  }
})